TITLE ЛР_2 
;------------------------------------------------------------------------------
;ЛР  №2
;------------------------------------------------------------------------------
;------------------------------------I.ЗАГОЛОВОК ПРОГРАМИ--------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
;---------------------------------------------II.МАКРОСИ---------------------------
MACRO M_Init
mov ax, @data
mov ds, ax
mov es, ax
ENDM M_Init
;-----------------------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ------------------------------------
DATASEG
exCode db 0					;код завершення роботи застосунку
rect_line dw 7330h,7330h,7330h,7330h,7330h
	dw 7330h,7330h,7330h,7330h,7330h
	dw 7330h,7330h,7330h,7330h,7330h
	dw 7330h,7330h,7330h,7330h,7330h

rect_line_length = $-rect_line			;довжина одного рядка
;-----------------------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ------------------------------------------
CODESEG
Start:
M_Init

	mov dx,2+160*15			; зміщення кута у координати (2;15)
	mov cx,10        		; лічильник повторень циклу

l:					;початок циклу
	
	mov bx, cx
	mov ax, 0B800h			;сегментна адресса відеопам'яті
	mov es, ax
	
	mov di, dx			;початок виведення на екран
 	mov si, offset rect_line	
	mov cx, rect_line_length	
	cld
	rep movsb
	mov cx, bx
	add dx, 160			;зміщення наступного рядка
loop l

Exit:
	mov ah,04ch
	mov al,[exCode]			; отримання коду виходу 
	int 21h				; виклик функції DOS 4ch
	
end Start